#include <iostream>   // підключаємо бібліотеку вводу-виводу 
// - містить опис всіх функцій, які  
//   забезпечують ввід-вивід 
#include <Windows.h>

using namespace std;  // використовуємо стандартний простір імен 
// - після цього доступ до ресурсів 
//   бібліотеки вводу-виводу буде не громіздкий, 
//   а компактний   41 

int main()            // головна функція - програма починає виконання 
{     
    SetConsoleCP(1251);          // встановлення кодової сторінки win-cp1251 
    // (кирилиця) в потік вводу 
    SetConsoleOutputCP(1251);    // встановлення кодової сторінки win-cp1251 
    // (кирилиця) в потік виводу// із функції main() 

    return 0;         // нульовий результат = сигнал для операційної 
}